# Получаваме текущото време
current_time = time.localtime()

# Определяме часа
current_hour = current_time.tm_hour

# Показваме текущото време
print("Текущото време е:", time.strftime("%H:%M:%S", current_time))

# Проверяваме дали е време за учене или почивка
if 8 <= current_hour < 12:
    print("Време е за учене! Да работим усилено!")
elif 12 <= current_hour < 14:
    print("Обедна почивка! Насладете се на храната си!")
elif 14 <= current_hour < 17:
    print("Отново е време за учене! Давайте всичко от себе си!")
elif 17 <= current_hour < 19:
    print("Може да се отпуснете малко, време е за почивка!")
else:
    print("Вече е късно, време е да си починете и да се подготвите за следващия ден!")
