CREATE DATABASE StoreDb;
GO

USE StoreDb;
GO

CREATE TABLE Products (
    Id INT PRIMARY KEY,
    Name NVARCHAR(50),
    Category NVARCHAR(50)
);
GO

INSERT INTO Products (Id, Name, Category)
VALUES
    (1, N'Лаптоп', N'Електроника'),
    (2, N'Смартфон', N'Електроника'),
    (3, N'Бюро', N'Мебели'),
    (4, N'Стол', N'Мебели'),
    (5, N'Слушалки', N'Електроника'),
    (6, N'Библиотека', N'Мебели'),
    (7, N'Таблет', N'Електроника'),
    (8, N'Кафемашина', N'Уреди'),
    (9, N'Принтер', N'Електроника'),
    (10, N'Диван', N'Мебели'),
    (11, N'Телевизор', N'Електроника'),
    (12, N'Разтегателен диван', N'Мебели'),
    (13, N'Блендер', N'Уреди'),
    (14, N'Раница', N'Аксесоари'),
    (15, N'Микровълнова', N'Уреди'),
    (16, N'Възглавница', N'Домашен декор'),
    (17, N'Лампа', N'Домашен декор'),
    (18, N'Камера', N'Електроника'),
    (19, N'Часовник', N'Аксесоари'),
    (20, N'Дънки', N'Дрехи'),
    (21, N'Пуловер', N'Дрехи'),
    (22, N'Шал', N'Аксесоари'),
    (23, N'Шапка', N'Аксесоари'),
    (24, N'Легло', N'Мебели'),
    (25, N'Трапезна маса', N'Мебели');
GO